# এখন, ফাংশনের ভেতর ভ্যারিয়েবল পাঠানো আর লিস্ট পাঠানোর মধ্যে একটি পার্থক্য আছে। যে ফাংশনের ভেতরে লিস্ট পাঠানো
# হয়েছে, সেখানে যদি লিস্টটি পরিবর্তন করা হয়, তাহলে আসল লিস্টও পরিবর্তিত হয়ে যায়। এটিও আমরা একটি প্রোগ্রাম লিখে যাচাই
# করো নেবো। তবে তার আগে আমাদের আরো একটি জিনিস জেনে নিতে হবে। আমরা যদি লিস্টের কোনো নির্দিষ্ট উপাদান পেতে চাই,
# যেমন প্রথম, দ্বিতীয়, তৃতীয় ইত্যাদি, তাহলে আমরা তৃতীয় বন্ধনীর ভেতরে সেই সংখ্যাটি উল্লেখ করে দিতে পারি। একে বলা হয়
# ইনডেক্স। তবে পাইথনে লিস্টের ইনডেক্স কিন্তু 1 থেকে নয়, 0 থেকে শুরু হয়। অর্থাৎ, আমরা যদি লিস্টের প্রথম উপাদান একসেস
# করতে চাই, তাহলে আমরা লিস্টের নামের পর [0] লিখবো। country নামের একটি লিস্টে যদি পৃথিবীর সবগুলো দেশের নাম থাকে,
# আর সেই লিস্টের 50-তম দেশটি আমরা দেখতে চাই, তাহলে আমাদেরকে country[49] প্রিন্ট করতে হবে


def test_fnc(li):
    li[0] = 10


my_list = [1, 2, 3, 4]
print("before function call", my_list)
test_fnc(my_list)
print("after function call", my_list)
# main list changed
print("Now Main List: ", my_list)
